affili/src/main/wsdl/Logon.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="Authentication" targetNamespace="http://affilinet.framework.webservices/Svc" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://affilinet.framework.webservices/Svc" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex">
<wsp:Policy wsu:Id="DefaultEndpointLogon_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy>
<wsdl:types>
<xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema>
<xsd:schema elementFormDefault="qualified" targetNamespace="http://affilinet.framework.webservices/types" xmlns:tns="http://affilinet.framework.webservices/types"><xsd:complexType name="Logon"><xsd:sequence><xsd:element minOccurs="0" name="Username" nillable="true" type="xsd:string"/><xsd:element minOccurs="0" name="Password" nillable="true" type="xsd:string"/><xsd:element name="WebServiceType" type="tns:WebServiceTypes"/><xsd:element minOccurs="0" name="DeveloperSettings" nillable="true" type="tns:TokenDeveloperDetails"/><xsd:element minOccurs="0" name="ApplicationSettings" nillable="true" type="tns:TokenApplicationDetails"/></xsd:sequence></xsd:complexType><xsd:element name="Logon" nillable="true" type="tns:Logon"/><xsd:simpleType name="WebServiceTypes"><xsd:restriction base="xsd:string"><xsd:enumeration value="Product"/><xsd:enumeration value="Publisher"/></xsd:restriction></xsd:simpleType><xsd:element name="WebServiceTypes" nillable="true" type="tns:WebServiceTypes"/><xsd:complexType name="TokenDeveloperDetails"><xsd:sequence><xsd:element minOccurs="0" name="SandboxPublisherID" nillable="true" type="xsd:int"/></xsd:sequence></xsd:complexType><xsd:element name="TokenDeveloperDetails" nillable="true" type="tns:TokenDeveloperDetails"/><xsd:complexType name="TokenApplicationDetails"><xsd:sequence><xsd:element minOccurs="0" name="ApplicationID" nillable="true" type="xsd:int"/><xsd:element minOccurs="0" name="DeveloperID" nillable="true" type="xsd:string"/></xsd:sequence></xsd:complexType><xsd:element name="TokenApplicationDetails" nillable="true" type="tns:TokenApplicationDetails"/><xsd:complexType name="affilinetWebserviceFault"><xsd:sequence><xsd:element minOccurs="0" name="ErrorMessages" nillable="true" type="q1:ArrayOfKeyValueOfstringstring" xmlns:q1="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/></xsd:sequence></xsd:complexType><xsd:element name="affilinetWebserviceFault" nillable="true" type="tns:affilinetWebserviceFault"/></xsd:schema><xsd:schema elementFormDefault="qualified" targetNamespace="http://affilinet.framework.webservices/Svc"><xsd:element name="LogonRequestMsg" nillable="true" type="q2:Logon" xmlns:q2="http://affilinet.framework.webservices/types"/><xsd:element name="CredentialToken" nillable="true" type="xsd:string"/><xsd:element name="ExpirationDate" type="xsd:dateTime"/></xsd:schema>
<xsd:schema elementFormDefault="qualified" targetNamespace="http://www.microsoft.com/practices/EnterpriseLibrary/2007/01/wcf/validation" xmlns:tns="http://www.microsoft.com/practices/EnterpriseLibrary/2007/01/wcf/validation"><xsd:complexType name="ValidationFault"><xsd:sequence><xsd:element minOccurs="0" name="Details" nillable="true" type="q3:ArrayOfValidationDetail" xmlns:q3="http://schemas.datacontract.org/2004/07/Microsoft.Practices.EnterpriseLibrary.Validation.Integration.WCF"/></xsd:sequence></xsd:complexType><xsd:element name="ValidationFault" nillable="true" type="tns:ValidationFault"/></xsd:schema>
<xsd:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Microsoft.Practices.EnterpriseLibrary.Validation.Integration.WCF" xmlns:tns="http://schemas.datacontract.org/2004/07/Microsoft.Practices.EnterpriseLibrary.Validation.Integration.WCF"><xsd:complexType name="ArrayOfValidationDetail"><xsd:sequence><xsd:element minOccurs="0" maxOccurs="unbounded" name="ValidationDetail" nillable="true" type="tns:ValidationDetail"/></xsd:sequence></xsd:complexType><xsd:element name="ArrayOfValidationDetail" nillable="true" type="tns:ArrayOfValidationDetail"/><xsd:complexType name="ValidationDetail"><xsd:sequence><xsd:element minOccurs="0" name="Key" nillable="true" type="xsd:string"/><xsd:element minOccurs="0" name="Message" nillable="true" type="xsd:string"/><xsd:element minOccurs="0" name="Tag" nillable="true" type="xsd:string"/></xsd:sequence></xsd:complexType><xsd:element name="ValidationDetail" nillable="true" type="tns:ValidationDetail"/></xsd:schema><xsd:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><xsd:complexType name="ArrayOfKeyValueOfstringstring"><xsd:annotation><xsd:appinfo><IsDictionary xmlns="http://schemas.microsoft.com/2003/10/Serialization/">true</IsDictionary></xsd:appinfo></xsd:annotation><xsd:sequence><xsd:element minOccurs="0" maxOccurs="unbounded" name="KeyValueOfstringstring"><xsd:complexType><xsd:sequence><xsd:element name="Key" nillable="true" type="xsd:string"/><xsd:element name="Value" nillable="true" type="xsd:string"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType><xsd:element name="ArrayOfKeyValueOfstringstring" nillable="true" type="tns:ArrayOfKeyValueOfstringstring"/></xsd:schema></wsdl:types>

<wsdl:message name="LogonRequest"><wsdl:part name="LogonRequestMsg" element="tns:LogonRequestMsg"/></wsdl:message><wsdl:message name="LogonResponse"><wsdl:part name="CredentialToken" element="tns:CredentialToken"/></wsdl:message><wsdl:message name="AuthenticationContract_Logon_ValidationFaultFault_FaultMessage"><wsdl:part name="detail" element="q4:ValidationFault" xmlns:q4="http://www.microsoft.com/practices/EnterpriseLibrary/2007/01/wcf/validation"/></wsdl:message><wsdl:message name="AuthenticationContract_Logon_affilinetWebserviceFaultFault_FaultMessage"><wsdl:part name="detail" element="q5:affilinetWebserviceFault" xmlns:q5="http://affilinet.framework.webservices/types"/></wsdl:message><wsdl:message name="GetIdentifierExpirationRequest"><wsdl:part name="CredentialToken" element="tns:CredentialToken"/></wsdl:message><wsdl:message name="GetIdentifierExpirationResponse"><wsdl:part name="ExpirationDate" element="tns:ExpirationDate"/></wsdl:message><wsdl:message name="AuthenticationContract_GetIdentifierExpiration_ValidationFaultFault_FaultMessage"><wsdl:part name="detail" element="q6:ValidationFault" xmlns:q6="http://www.microsoft.com/practices/EnterpriseLibrary/2007/01/wcf/validation"/></wsdl:message><wsdl:message name="AuthenticationContract_GetIdentifierExpiration_affilinetWebserviceFaultFault_FaultMessage"><wsdl:part name="detail" element="q7:affilinetWebserviceFault" xmlns:q7="http://affilinet.framework.webservices/types"/></wsdl:message>

<wsdl:portType name="AuthenticationContract"><wsdl:operation name="Logon"><wsdl:input wsaw:Action="http://affilinet.framework.webservices/Svc/ServiceContract1/Logon" name="LogonRequest" message="tns:LogonRequest"/><wsdl:output wsaw:Action="http://affilinet.framework.webservices/Svc/AuthenticationContract/LogonResponse" name="LogonResponse" message="tns:LogonResponse"/><wsdl:fault wsaw:Action="http://affilinet.framework.webservices/Svc/AuthenticationContract/LogonValidationFaultFault" name="ValidationFaultFault" message="tns:AuthenticationContract_Logon_ValidationFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://affilinet.framework.webservices/Svc/AuthenticationContract/LogonaffilinetWebserviceFaultFault" name="affilinetWebserviceFaultFault" message="tns:AuthenticationContract_Logon_affilinetWebserviceFaultFault_FaultMessage"/></wsdl:operation><wsdl:operation name="GetIdentifierExpiration"><wsdl:input wsaw:Action="http://affilinet.framework.webservices/Svc/AuthenticationContract/GetIdentifierExpiration" name="GetIdentifierExpirationRequest" message="tns:GetIdentifierExpirationRequest"/><wsdl:output wsaw:Action="http://affilinet.framework.webservices/Svc/AuthenticationContract/GetIdentifierExpirationResponse" name="GetIdentifierExpirationResponse" message="tns:GetIdentifierExpirationResponse"/><wsdl:fault wsaw:Action="http://affilinet.framework.webservices/Svc/AuthenticationContract/GetIdentifierExpirationValidationFaultFault" name="ValidationFaultFault" message="tns:AuthenticationContract_GetIdentifierExpiration_ValidationFaultFault_FaultMessage"/><wsdl:fault wsaw:Action="http://affilinet.framework.webservices/Svc/AuthenticationContract/GetIdentifierExpirationaffilinetWebserviceFaultFault" name="affilinetWebserviceFaultFault" message="tns:AuthenticationContract_GetIdentifierExpiration_affilinetWebserviceFaultFault_FaultMessage"/></wsdl:operation></wsdl:portType>

<wsdl:binding name="DefaultEndpointLogon" type="tns:AuthenticationContract"><wsp:PolicyReference URI="#DefaultEndpointLogon_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Logon"><soap:operation soapAction="http://affilinet.framework.webservices/Svc/ServiceContract1/Logon" style="document"/><wsdl:input name="LogonRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="LogonResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="ValidationFaultFault"><soap:fault name="ValidationFaultFault" use="literal"/></wsdl:fault><wsdl:fault name="affilinetWebserviceFaultFault"><soap:fault name="affilinetWebserviceFaultFault" use="literal"/></wsdl:fault></wsdl:operation><wsdl:operation name="GetIdentifierExpiration"><soap:operation soapAction="http://affilinet.framework.webservices/Svc/AuthenticationContract/GetIdentifierExpiration" style="document"/><wsdl:input name="GetIdentifierExpirationRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="GetIdentifierExpirationResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="ValidationFaultFault"><soap:fault name="ValidationFaultFault" use="literal"/></wsdl:fault><wsdl:fault name="affilinetWebserviceFaultFault"><soap:fault name="affilinetWebserviceFaultFault" use="literal"/></wsdl:fault></wsdl:operation></wsdl:binding>

<wsdl:service name="Authentication"><wsdl:port name="DefaultEndpointLogon" binding="tns:DefaultEndpointLogon"><soap:address location="https://developer-api.affili.net/V2.0/Logon.svc"/></wsdl:port></wsdl:service></wsdl:definitions>
