src/tasks/affiliate-networks/api-clients/affilinet/templates/check.hbs

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:ns1="http://affilinet.framework.webservices/types"
  xmlns:ns2="http://affilinet.framework.webservices/Svc">
  <SOAP-ENV:Body>
    <ns2:CredentialToken>{{token}}</ns2:CredentialToken>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
