features/fixtures/affili_net_no_result_savon_dialogue

D, [2010-08-20T15:41:06.162050 #25168] DEBUG -- : Retrieving WSDL from: https://api.affili.net/V2.0/Logon.svc?wsdl
warning: peer certificate won't be verified in this SSL session
D, [2010-08-20T15:41:06.394091 #25168] DEBUG -- : SOAP request: https://api.affili.net/V2.0/Logon.svc
D, [2010-08-20T15:41:06.394196 #25168] DEBUG -- : SOAPAction: http://affilinet.framework.webservices/Svc/ServiceContract1/Logon, Content-Type: text/xml;charset=UTF-8
D, [2010-08-20T15:41:06.395180 #25168] DEBUG -- : <env:Envelope xmlns:wsdl="http://affilinet.framework.webservices/Svc" xmlns:ns1="http://affilinet.framework.webservices/types" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><wsdl:LogonRequestMsg><ns1:Username>524680</ns1:Username><ns1:Password>KftkUjx0OtTd4Ca84j9i</ns1:Password><ns1:WebServiceType>Product</ns1:WebServiceType></wsdl:LogonRequestMsg></env:Body></env:Envelope>
D, [2010-08-20T15:41:11.208439 #25168] DEBUG -- : SOAP response (status 200):
D, [2010-08-20T15:41:11.208550 #25168] DEBUG -- : <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><CredentialToken xmlns="http://affilinet.framework.webservices/Svc">a0b9087b-f656-4a8d-a510-dcf949fd5ffb</CredentialToken></s:Body></s:Envelope>
D, [2010-08-20T15:41:11.209522 #25168] DEBUG -- : Retrieving WSDL from: https://api.affili.net/V2.0/ProductServices.svc?wsdl
warning: peer certificate won't be verified in this SSL session
D, [2010-08-20T15:41:11.551543 #25168] DEBUG -- : SOAP request: https://api.affili.net/V2.0/ProductServices.svc
D, [2010-08-20T15:41:11.551658 #25168] DEBUG -- : SOAPAction: http://affilinet.framework.webservices/Svc/ProductServiceContract/SearchProducts, Content-Type: text/xml;charset=UTF-8
D, [2010-08-20T15:41:11.553376 #25168] DEBUG -- : <env:Envelope xmlns:wsdl="http://affilinet.framework.webservices/Svc" xmlns:ns2="http://affilinet.framework.webservices/types/ProductService" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><wsdl:SearchProductsRequest><wsdl:CredentialToken>a0b9087b-f656-4a8d-a510-dcf949fd5ffb</wsdl:CredentialToken><wsdl:SearchProductsRequestMessage><ns2:ShopIds></ns2:ShopIds><ns2:Query>1000000000001</ns2:Query><ns2:WithImageOnly>false</ns2:WithImageOnly><ns2:Details>false</ns2:Details><ns2:SortOrder>Ascending</ns2:SortOrder><ns2:CurrentPage>1</ns2:CurrentPage><ns2:PageSize>10</ns2:PageSize><ns2:MinimumPrice>0</ns2:MinimumPrice><ns2:MaximumPrice>0</ns2:MaximumPrice><ns2:SortBy>Rank</ns2:SortBy><ns2:ImageSize>AllImages</ns2:ImageSize></wsdl:SearchProductsRequestMessage></wsdl:SearchProductsRequest></env:Body></env:Envelope>
D, [2010-08-20T15:41:11.943010 #25168] DEBUG -- : SOAP response (status 200):
D, [2010-08-20T15:41:11.943106 #25168] DEBUG -- : <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><ProductSearchResult xmlns="http://affilinet.framework.webservices/Svc" xmlns:a="http://affilinet.framework.webservices/types/ProductService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:Records>0</a:Records><a:TotalRecords>0</a:TotalRecords><a:TotalPages>0</a:TotalPages><a:CurrentPage>0</a:CurrentPage><a:Products/></ProductSearchResult></s:Body></s:Envelope>
